docs/index.html
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
  <head>
    <!-- 2022-03-16 Wed 01:22 -->
    <meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
    <meta name="viewport" content="width=device-width, initial-scale=1" />
    <title>README for js-generic-functions</title>
    <meta name="author" content="Ed L" />
    <meta name="generator" content="Org Mode" />
    <link rel="stylesheet" href="./colors.css" />
  </head>
  <body>
    <div id="content" class="content">
      <h1 class="title">README for js-generic-functions</h1>
      <div id="table-of-contents" role="doc-toc">
        <h2>Table of Contents</h2>
        <div id="text-table-of-contents" role="doc-toc">
          <ul>
            <li><a href="#orgfafc37c">1. What is this?</a></li>
            <li>
              <a href="#org9f23f39">2. Docs</a>
              <ul>
                <li><a href="#orgd157493">2.1. Basic Usage</a></li>
                <li>
                  <a href="#orgfff236b">2.2. Other sorts of specializers</a>
                </li>
              </ul>
            </li>
          </ul>
        </div>
      </div>

      <div id="outline-container-orgfafc37c" class="outline-2">
        <h2 id="orgfafc37c">
          <span class="section-number-2">1.</span> What is this?
        </h2>
        <div class="outline-text-2" id="text-1">
          <p>
            An implementation of generic functions based on CLOS and the
            protocols defined in the Art of the Metaobject protocol, adapted for
            JS. These adaptations include using the prototype chain instead of
            classes and additionally providing extensible specializers (as in
            <a href="https://github.com/sbcl/specializable"
              >https://github.com/sbcl/specializable</a
            >). For the moment, this is only used to provide a Shape
            specializer, as the details of the interaction between such
            specializers and subtyping are an open question.
          </p>
        </div>
      </div>

      <div id="outline-container-org9f23f39" class="outline-2">
        <h2 id="org9f23f39"><span class="section-number-2">2.</span> Docs</h2>
        <div class="outline-text-2" id="text-2"></div>
        <div id="outline-container-orgd157493" class="outline-3">
          <h3 id="orgd157493">
            <span class="section-number-3">2.1.</span> Basic Usage
          </h3>
          <div class="outline-text-3" id="text-2-1">
            <div class="org-src-container">
              <pre
                class="src src-js"
                id="org5053093"
              ><span style="color: #F0DFAF;">import</span> { defgeneric } from <span style="color: #D0BF8F;">"./genfuns.js"</span>;
</pre>
            </div>

            <p>
              Defining a function works by calling with some information about
              the function name and arguments. Methods are then added by calling
              the appropriate methods with a pair of arguments: a list of
              specializers (prototypes in the simple case, although there are
              other options) and a function to run if those specializers match.
            </p>

            <div class="org-src-container">
              <pre
                class="src src-js"
                id="orgbfcefb2"
              ><span style="color: #F0DFAF;">const</span> <span style="color: #DC8CC3;">example1generic</span> = defgeneric(<span style="color: #D0BF8F;">"example1"</span>, <span style="color: #D0BF8F;">"a"</span>, <span style="color: #D0BF8F;">"b"</span>)
  .primary([Number, Object], (n, __) =&gt; [1, n])
  .primary([Object, Number], (_, n) =&gt; [2, n])
  .primary([Object, Object], (_, __) =&gt; [5, <span style="font-weight: bold;">null</span>]);
</pre>
            </div>

            <p>
              After a generic function has been defined, you can get the
              function to call it by accessing its attribute.
            </p>

            <div class="org-src-container">
              <pre
                class="src src-js"
                id="orgcb5dfea"
              ><span style="color: #F0DFAF;">const</span> <span style="color: #DC8CC3;">example1</span> = example1generic.fn;

expect(example1(5, {})).toEqual([1, 5]);
expect(example1({}, 6)).toEqual([2, 6]);
expect(example1(<span style="color: #D0BF8F;">"hello"</span>, {})).toEqual([5, <span style="font-weight: bold;">null</span>]);
expect(example1({}, <span style="color: #D0BF8F;">"world"</span>)).toEqual([5, <span style="font-weight: bold;">null</span>]);
expect(example1({}, {})).toEqual([5, <span style="font-weight: bold;">null</span>]);
</pre>
            </div>

            <p>
              If a separate reference to the generic function object is
              maintained, you can add methods like so:
            </p>

            <div class="org-src-container">
              <pre class="src src-js" id="orgda77441">example1generic
  .primary([String, Object], (s, __) =&gt; [3, s])
  .primary([Object, String], (_, s) =&gt; [4, s]);

expect(example1(<span style="color: #D0BF8F;">"hello"</span>, {})).toEqual([3, <span style="color: #D0BF8F;">"hello"</span>]);
expect(example1({}, <span style="color: #D0BF8F;">"world"</span>)).toEqual([4, <span style="color: #D0BF8F;">"world"</span>]);
</pre>
            </div>
          </div>
        </div>

        <div id="outline-container-orgfff236b" class="outline-3">
          <h3 id="orgfff236b">
            <span class="section-number-3">2.2.</span> Other sorts of
            specializers
          </h3>
          <div class="outline-text-3" id="text-2-2">
            <div class="org-src-container">
              <pre
                class="src src-js"
                id="org0346038"
              ><span style="color: #F0DFAF;">import</span> { Shape, Eql } from <span style="color: #D0BF8F;">"./genfuns.js"</span>;
</pre>
            </div>

            <div class="org-src-container">
              <pre
                class="src src-js"
                id="org89b4645"
              ><span style="color: #F0DFAF;">const</span> <span style="color: #DC8CC3;">example2</span> = defgeneric(<span style="color: #D0BF8F;">"example2"</span>, <span style="color: #D0BF8F;">"inp"</span>)
  .primary([Shape(<span style="color: #D0BF8F;">"a"</span>, <span style="color: #D0BF8F;">"b"</span>)], inp =&gt; <span style="color: #D0BF8F;">`a: ${inp.a} b: ${inp.b}`</span>)
  .primary([Shape(<span style="color: #D0BF8F;">"a"</span>)], inp =&gt; <span style="color: #D0BF8F;">`a: ${inp.a} b: &lt;missing&gt;`</span>)
  .primary([Shape([<span style="color: #D0BF8F;">"c"</span>, 1])], inp =&gt; <span style="color: #D0BF8F;">`c: one`</span>)
  .primary([Shape([<span style="color: #D0BF8F;">"c"</span>, 2])], inp =&gt; <span style="color: #D0BF8F;">`c: two`</span>)
  .primary([Eql(1)], inp =&gt; <span style="color: #D0BF8F;">"one"</span>).fn;

expect(example2({ a: 3, q: <span style="color: #D0BF8F;">"whatever"</span> })).toEqual(<span style="color: #D0BF8F;">"a: 3 b: &lt;missing&gt;"</span>);
expect(example2({ a: 3, b: 4, q: <span style="color: #D0BF8F;">"whatever"</span> })).toEqual(<span style="color: #D0BF8F;">"a: 3 b: 4"</span>);
expect(example2({ c: 1, q: <span style="color: #D0BF8F;">"whatever"</span> })).toEqual(<span style="color: #D0BF8F;">"c: one"</span>);
expect(example2({ c: 2, q: <span style="color: #D0BF8F;">"whatever"</span> })).toEqual(<span style="color: #D0BF8F;">"c: two"</span>);
expect(example2(1)).toEqual(<span style="color: #D0BF8F;">"one"</span>);
</pre>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div id="postamble" class="status">
      <p class="author">Author: Ed L</p>
      <p class="date">Created: 2022-03-16 Wed 01:22</p>
      <p class="validation">
        <a href="https://validator.w3.org/check?uri=referer">Validate</a>
      </p>
    </div>
  </body>
</html>
